In [1]:
from xml.dom.minidom import Entity
import pandas as pd
import numpy as np

Debes utilizar Pandas para ingestar en un objeto Dataframe el contenido del archivo provisto
"Fuentes_Consumo_Energia.csv".
Esta función debe informar la cantidad de registros cuya entidad sean Colombia o México retornando ese
valor en un dato de tipo tupla (catidad de registros Colombia, catidad de registros México).
Pista: averiguar la funcion Shape

In [2]:
df=pd.read_csv("datasets/Fuentes_Consumo_Energia.csv")

In [4]:
df.head()

,Entity,Code,Year,Coal_Consumption_EJ,Gas_Consumption_EJ,Geo_Biomass_Other_TWh,Hydro_Generation_TWh,Nuclear_Generation_TWh,Solar_Generation_TWh,Wind_Generation_TWh,Oil_Consumption_EJ
0,Africa,NaN,1965,1.164586,0.034358,0.0,13.905635,0.0,0.0,0.0,1.173241
1,Africa,NaN,1966,1.163240,0.038412,0.0,15.510004,0.0,0.0,0.0,1.284154
2,Africa,NaN,1967,1.189050,0.037964,0.0,16.190636,0.0,0.0,0.0,1.273799
3,Africa,NaN,1968,1.236646,0.038480,0.0,18.938341,0.0,0.0,0.0,1.344219
4,Africa,NaN,1969,1.247915,0.044971,0.0,22.100890,0.0,0.0,0.0,1.362729

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5190 entries, 0 to 5189
Data columns (total 11 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Entity                  5190 non-null   object
 1   Code                    4145 non-null   object
 2   Year                    5190 non-null   int64
 3   Coal_Consumption_EJ     5170 non-null   float64
 4   Gas_Consumption_EJ      5170 non-null   float64
 5   Geo_Biomass_Other_TWh   5115 non-null   float64
 6   Hydro_Generation_TWh    5170 non-null   float64
 7   Nuclear_Generation_TWh  5170 non-null   float64
 8   Solar_Generation_TWh    5170 non-null   float64
 9   Wind_Generation_TWh     5170 non-null   float64
 10  Oil_Consumption_EJ      5184 non-null   float64
dtypes: float64(8), int64(1), object(2)
memory usage: 446.1+ KB

In [21]:
a=(df["Entity"]=="Colombia")

In [11]:
a[897]

True

In [18]:
df[a==True].head()

,Entity,Code,Year,Coal_Consumption_EJ,Gas_Consumption_EJ,Geo_Biomass_Other_TWh,Hydro_Generation_TWh,Nuclear_Generation_TWh,Solar_Generation_TWh,Wind_Generation_TWh,Oil_Consumption_EJ
895,Colombia,COL,1965,0.084322,0.032225,0.0,3.543949,0.0,0.0,0.0,0.165758
896,Colombia,COL,1966,0.084322,0.033611,0.0,3.937219,0.0,0.0,0.0,0.188919
897,Colombia,COL,1967,0.092528,0.041580,0.0,4.389254,0.0,0.0,0.0,0.190582
898,Colombia,COL,1968,0.084280,0.042377,0.0,4.891012,0.0,0.0,0.0,0.212734
899,Colombia,COL,1969,0.089974,0.046275,0.0,5.437973,0.0,0.0,0.0,0.204372

In [16]:
df[a==True].shape

(55, 11)

In [17]:
df[a==True].shape[0]

55

In [52]:
a= df[df["Entity"]=="Colombia"].shape[0]

In [53]:
b= df[df["Entity"]=="Mexico"].shape[0]

In [54]:
(a,b)

(55, 55)

2
Debes utilizar Pandas para ingestar en un objeto Dataframe el contenido del archivo provisto
    "Fuentes_Consumo_Energia.csv".
    Esta función debe eliminar las columnas 'Code' y 'Entity' y luego informar la cantidad de columnas
    retornando ese valor en un dato de tipo entero.

In [55]:
df.head()

,Entity,Code,Year,Coal_Consumption_EJ,Gas_Consumption_EJ,Geo_Biomass_Other_TWh,Hydro_Generation_TWh,Nuclear_Generation_TWh,Solar_Generation_TWh,Wind_Generation_TWh,Oil_Consumption_EJ
0,Africa,NaN,1965,1.164586,0.034358,0.0,13.905635,0.0,0.0,0.0,1.173241
1,Africa,NaN,1966,1.163240,0.038412,0.0,15.510004,0.0,0.0,0.0,1.284154
2,Africa,NaN,1967,1.189050,0.037964,0.0,16.190636,0.0,0.0,0.0,1.273799
3,Africa,NaN,1968,1.236646,0.038480,0.0,18.938341,0.0,0.0,0.0,1.344219
4,Africa,NaN,1969,1.247915,0.044971,0.0,22.100890,0.0,0.0,0.0,1.362729

In [58]:
c = df.drop(columns= ['Code' , 'Entity'])

In [59]:
c.head()

,Year,Coal_Consumption_EJ,Gas_Consumption_EJ,Geo_Biomass_Other_TWh,Hydro_Generation_TWh,Nuclear_Generation_TWh,Solar_Generation_TWh,Wind_Generation_TWh,Oil_Consumption_EJ
0,1965,1.164586,0.034358,0.0,13.905635,0.0,0.0,0.0,1.173241
1,1966,1.163240,0.038412,0.0,15.510004,0.0,0.0,0.0,1.284154
2,1967,1.189050,0.037964,0.0,16.190636,0.0,0.0,0.0,1.273799
3,1968,1.236646,0.038480,0.0,18.938341,0.0,0.0,0.0,1.344219
4,1969,1.247915,0.044971,0.0,22.100890,0.0,0.0,0.0,1.362729

In [61]:
c.shape[1]

9

In [62]:
type(c.shape[1])

int

In [63]:
c.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5190 entries, 0 to 5189
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Year                    5190 non-null   int64
 1   Coal_Consumption_EJ     5170 non-null   float64
 2   Gas_Consumption_EJ      5170 non-null   float64
 3   Geo_Biomass_Other_TWh   5115 non-null   float64
 4   Hydro_Generation_TWh    5170 non-null   float64
 5   Nuclear_Generation_TWh  5170 non-null   float64
 6   Solar_Generation_TWh    5170 non-null   float64
 7   Wind_Generation_TWh     5170 non-null   float64
 8   Oil_Consumption_EJ      5184 non-null   float64
dtypes: float64(8), int64(1)
memory usage: 365.0 KB

3 resuleto

In [70]:
df=pd.read_csv("datasets/Fuentes_Consumo_Energia.csv")
d = df[df["Entity"]=="Europe"]
d = d[  d["Hydro_Generation_TWh"]==d["Hydro_Generation_TWh"].max()]
int(d["Year"].values[0])

2013

In [72]:
int(d["Year"].values[0])

2013

5 resuelto 4 pendiente

 Esta función recibe tres array de Numpy de 2 dimensiones cada uno, y devuelve el valor booleano
    True si es posible realizar una multiplicación entre las tres matrices (n1 x n2 x n3),
    y el valor booleano False si no lo es
    Ej:
        n1 = np.array([[0,0,0],[1,1,1],[2,2,2]])
        n2 = np.array([[3,3],[4,4],[5,5]])
        n3 = np.array([1,1],[2,2])
        print(Ret_Pregunta06(n1,n2,n3))
            True            -> Valor devuelto por la función en este ejemplo
        print(Ret_Pregunta06(n2,n1,n3))
            False            -> Valor devuelto por la función en este ejemplo

In [74]:
n1 = np.array([[0,0,0],[1,1,1],[2,2,2]])
n2 = np.array([[3,3],[4,4],[5,5]])
n3 = np.array([[1,1],[2,2]])
n1.shape

(3, 3)

In [77]:
n1.shape[1] == n2.shape[0]

True

In [78]:
n2.shape[1] == n3.shape[0]

True

In [79]:
int(df["Entity"].value_counts().shape[0])

100

In [83]:
''' Debes utilizar Pandas para ingestar en un objeto Dataframe el contenido del archivo provisto
"datasets/Tabla1_ejercicio.csv" y "datasets/Tabla2_ejercicio.csv".
Esta función debe retornar: score_promedio_femenino y score_promedio_masculino en formato tupla, teniendo 
en cuenta que no debe haber valores repetidos.'''
#Tu código aca:
t1 = pd.read_csv("datasets/Tabla1_ejercicio.csv", sep =";")
t2 = pd.read_csv("datasets/Tabla2_ejercicio.csv", sep =";")

In [84]:
t1.head()

       pers_id sexo  edad      ingreso            situacion_lab
0  71906556521    F    47  35926.28125  Sin_situacion_declarada
1  73861260912    F    41  16231.12207  Sin_situacion_declarada
2  24939194469    F    40  25068.96484     Relacion_dependencia
3  21033369421    F    52  30239.54883                 Jubilado
4  45334163605    F    46  12654.58203     Relacion_dependencia

In [85]:
t2.head()

    pers_id  periodo  score
0  27817725   201906    814
1  37570691   201906    597
2  40181240   201906    251
3  52105045   201906    617
4  63502595   201906    392

In [86]:
t1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   pers_id        5000 non-null   int64
 1   sexo           5000 non-null   object
 2   edad           5000 non-null   int64
 3   ingreso        5000 non-null   float64
 4   situacion_lab  5000 non-null   object
dtypes: float64(1), int64(2), object(2)
memory usage: 195.4+ KB

In [87]:
t2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14997 entries, 0 to 14996
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   pers_id  14997 non-null  int64
 1   periodo  14997 non-null  int64
 2   score    14997 non-null  int64
dtypes: int64(3)
memory usage: 351.6 KB

In [88]:
t1["pers_id"].value_counts()

71906556521    2
31414312693    2
17186678650    2
70734373700    2
56028074214    2
              ..
69108968622    1
34194408076    1
63225860149    1
32885845447    1
92370836565    1
Name: pers_id, Length: 4853, dtype: int64

In [95]:
t1_unico = t1["pers_id"].drop_duplicates()
t1_unico.index

Int64Index([   0,    1,    2,    3,    4,    5,    6,    7,    8,    9,
            ...
            4990, 4991, 4992, 4993, 4994, 4995, 4996, 4997, 4998, 4999],
           dtype='int64', length=4853)

In [97]:
t1.iloc[t1_unico.index,0:2]

          pers_id sexo
0     71906556521    F
1     73861260912    F
2     24939194469    F
3     21033369421    F
4     45334163605    F
...           ...  ...
4995  77317158601    M
4996   7865860477    M
4997   2875330898    M
4998  57646643429    M
4999  92370836565    M

[4853 rows x 2 columns]

In [105]:
t2.groupby("pers_id").sum()["score"].iloc[:,1]

IndexingError: Too many indexers